Config/Documents/ПоручениеНаПродажуВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоручениеНаПродажуВалюты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗачисленияРублей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УполномоченныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыСчетаЗачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРублейКЗачислению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КБКНазначениеПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КОСГУНазначениеПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ТипыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Казначейский</Name>
					<Comment>Лицевой счет открыт в органе казначейства или финансовом органе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Счет открыт в учреждении банка, кредитной организации или на едином казначейском счете</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СтатусыИсполненияДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыИсполненияДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданВОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполненЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/РеквизитыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РеквизитыЛицевыхСчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЛицевыеСчета</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестонахождениеФилиалаБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентТекст</Name>
					<Comment>Наименование корреспондента по требованиям банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентИНН</Name>
					<Comment>ИНН корреспондента по требованиям банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентКПП</Name>
					<Comment>КПП корреспондента по требованиям банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаУказыватьКПП</Name>
					<Comment>Всегда указывать КПП в платежных документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ПоручениеНаПродажуВалюты/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
			ПолучитьЛицевойСчетПоУмолчанию();
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДоступностьВалютныхРеквизитов(ЭтаФорма);
	
	Элементы.РасшифровкаПлатежаИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(Объект.ЛицевойСчет));
	
	ПлатежноРасчетныеДокументы.ЗаполнитьДопустимыеКФОиИсточникиСредств(Объект.ЛицевойСчет,СписокДопустимыхКФО,СписокИсточниковСредствПоКФО);
	
	ПлатежноРасчетныеДокументы.ПриСозданииНаСервереФормыДокумента(ЭтаФорма);
	
	ДатаКурсаВалюты = ПолучитьДатуКурсаВалюты(ЭтаФорма);
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда 
		Объект.ВалютаДокумента = ВалютаРегламентированногоУчета;
		Объект.Курс 			= 1;
		Объект.Кратность 		= 1;
	ИначеЕсли Параметры.Ключ.Пустая() И Объект.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
		КурсКратность = ПолучитьКурс(Объект.ВалютаДокумента,ДатаКурсаВалюты);
		Объект.Курс 			= КурсКратность.Курс;
		Объект.Кратность 		= КурсКратность.Кратность;
		ПересчитатьРублевоеПокрытие(ЭтаФорма, Объект);
	КонецЕсли;
	
	УстановитьДоступностьГруппыИсполнение(ЭтаФорма);
	
	РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
	
	ПолучитьРеквизитыСчетаЗачисления();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ,
													 СтандартнаяОбработка, 
													 Элементы.БухгалтерскаяОперация, 
													 Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	БухгалтерскиеОперацииСервер.ПриИзмененииПараметровФункциональныхОпций(Элементы.БухгалтерскаяОперация);
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	//ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	ДополнительныеПараметры.Вставить("Объект", Объект);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	БухгалтерскиеОперацииСервер.ПриИзмененииПараметровФункциональныхОпций(Элементы.БухгалтерскаяОперация);
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации();
	
	РассчитатьКурсовуюРазницу(ЭтаФорма,Объект);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ПлатежноРасчетныеДокументы.ПередЗаписьюНаСервереДокумента(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	БухгалтерскиеОперацииКлиент.ПриОткрытии(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части

	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства 
	
	ПлатежноРасчетныеДокументыКлиент.ОбработатьОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
	УстановитьДоступностьГруппыИсполнение(ЭтаФорма);
	
	ДатаКурсаВалютыНовая = НачалоДня(ПолучитьДатуКурсаВалюты(ЭтаФорма));
	Если ДатаКурсаВалюты <> ДатаКурсаВалютыНовая Тогда
		ДатаКурсаВалюты = ДатаКурсаВалютыНовая;
		Если Объект.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
			ОбновитьКурсВалюты(ЭтаФорма,Объект);
			БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(Истина, Ложь);
		КонецЕсли;
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыПодсистемыИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаВВалютеПриИзменении(Элемент)
	
	ПересчитатьРублевоеПокрытие(ЭтаФорма, Объект);
	
	РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
	
	РассчитатьКурсовуюРазницу(ЭтаФорма,Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ПриИзмененииЛицевогоСчета();
	
	УстановитьДоступностьВалютныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация, ТекущаяСтрока, НаДату", Объект.Организация, Объект.ЛицевойСчет, Объект.Дата);
	
	КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	НастройкаКомпоновщика = КомпоновщикНастроекКомпоновкиДанных.Настройки;
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(НастройкаКомпоновщика.Отбор,
		"ВалютаСчета",ВидСравненияКомпоновкиДанных.НеРавно,ВалютаРегламентированногоУчета,,Истина);
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкаКомпоновщика);
	
	ОткрытьФорму("Справочник.ЛицевыеСчета.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановленныйСтатусДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СтатусЭтогоДокументаНажатие(Элемент)
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СуммаРублейКЗачислениюПриИзменении(Элемент)
	РассчитатьКурсовуюРазницу(ЭтаФорма,Объект);
КонецПроцедуры

&НаКлиенте
Процедура СчетЗачисленияРублейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация, ТекущаяСтрока, НаДату", Объект.Организация, Объект.РеквизитыСчетаЗачисления, Объект.Дата);
	ОткрытьФорму("Справочник.РеквизитыЛицевыхСчетов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СчетЗачисленияРублейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Объект.РеквизитыСчетаЗачисления = ВыбранноеЗначение;
	ПолучитьЛицевойСчетЗачисления();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СчетЗачисленияРублейОчистка(Элемент, СтандартнаяОбработка)
	Объект.РеквизитыСчетаЗачисления = "";
	ПолучитьЛицевойСчетЗачисления();
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	ПересчитатьРублевоеПокрытие(ЭтаФорма, Объект);
	РассчитатьКурсовуюРазницу(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	СуммаВведеннаяВручную = Объект.СуммаДокумента;
	Объект.Курс = СуммаВведеннаяВручную/Объект.СуммаДокументаВВалюте*?(Объект.Кратность=0,1,Объект.Кратность);
	ПересчитатьРублевоеПокрытие(ЭтаФорма, Объект);
	Если СуммаВведеннаяВручную <> Объект.СуммаДокумента Тогда
		Объект.СуммаДокумента = СуммаВведеннаяВручную;
	КонецЕсли;
	РассчитатьКурсовуюРазницу(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаКБКНазначениеПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													ТекущиеДанные.КБКНазначениеПлатежа, 
													Объект.Организация,
													Объект.ИФО,
													,
													,
													Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаСуммаВалПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаВал*Объект.Курс/?(Объект.Кратность=0,1,Объект.Кратность);
	РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока Тогда
		Возврат
	КонецЕсли;
	
	СтрокаПлатеж = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.КФО) Тогда
		Если СтрокаПлатеж.НомерСтроки > 1 Тогда
			СтрокаПлатеж.КФО = Объект.РасшифровкаПлатежа[СтрокаПлатеж.НомерСтроки-2].КФО;
		Иначе
			Если СписокДопустимыхКФО.Количество() > 0 Тогда
				СтрокаПлатеж.КФО = СписокДопустимыхКФО[0].Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПлатеж.ИсточникСредств) Тогда
		Если СтрокаПлатеж.НомерСтроки > 1 Тогда
			СтрокаПлатеж.ИсточникСредств = Объект.РасшифровкаПлатежа[СтрокаПлатеж.НомерСтроки-2].ИсточникСредств;
		Иначе
			ИсточникиСредствПоКФО = СписокИсточниковСредствПоКФО.НайтиСтроки(Новый Структура("КФО",СтрокаПлатеж.КФО));
			Если ИсточникиСредствПоКФО.Количество() > 0 Тогда
				СписокИСпоКФО = ИсточникиСредствПоКФО[0].СписокИсточников;
				Если СписокИСпоКФО.Количество() > 0 Тогда
					СтрокаПлатеж.ИсточникСредств = СписокИСпоКФО[0].Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СуммаДокумента) Тогда
		СтрокаПлатеж.Сумма 		= Объект.СуммаДокумента - (Объект.РасшифровкаПлатежа.Итог("Сумма") - СтрокаПлатеж.Сумма);
		СтрокаПлатеж.СуммаВал	= Объект.СуммаДокументаВВалюте - (Объект.РасшифровкаПлатежа.Итог("СуммаВал") - СтрокаПлатеж.СуммаВал);
	КонецЕсли;
	
	Если Копирование Тогда
		Возврат
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаПослеУдаления(Элемент)
	РассчитатьРазницуШапкиИИтогаТЧ(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаИсточникСредствНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ИсточникиСредствПоКФО = СписокИсточниковСредствПоКФО.НайтиСтроки(Новый Структура("КФО",ТекущиеДанные.КФО));
	Если ИсточникиСредствПоКФО.Количество() > 0 Тогда
		Элементы.РасшифровкаПлатежаИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ИсточникиСредствПоКФО[0].СписокИсточников.ВыгрузитьЗначения());
	Иначе
		Элементы.РасшифровкаПлатежаИсточникСредств.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПлатежаКФОПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	ИсточникиСредствПоКФО = СписокИсточниковСредствПоКФО.НайтиСтроки(Новый Структура("КФО",ТекущиеДанные.КФО));
	
	Если ИсточникиСредствПоКФО.Количество() > 0 Тогда
		СписокИСпоКФО = ИсточникиСредствПоКФО[0].СписокИсточников;
		Если СписокИСпоКФО.НайтиПоЗначению(ТекущиеДанные.ИсточникСредств) = Неопределено Тогда
			ТекущиеДанные.ИсточникСредств = "";
			Если СписокИСпоКФО.Количество() > 0 Тогда
				ТекущиеДанные.ИсточникСредств = СписокИСпоКФО[0].Значение;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекущиеДанные.ИсточникСредств = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
	ПолучитьЛицевойСчетПоУмолчанию();
	
	Объект.РеквизитыСчетаЗачисления = Справочники.РеквизитыЛицевыхСчетов.ПустаяСсылка();
	ПолучитьРеквизитыСчетаЗачисления();
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		БухгалтерскиеОперацииСервер.ПриИзмененииПараметровФункциональныхОпций(Элементы.БухгалтерскаяОперация);
	КонецЕсли;
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЛицевогоСчета()
	
	ДопустимыеИсточникиСредств = СписокВыбораИсточникСредств(Объект.ЛицевойСчет);
	
	Элементы.РасшифровкаПлатежаИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ДопустимыеИсточникиСредств);
	
	ПлатежноРасчетныеДокументы.ЗаполнитьДопустимыеКФОиИсточникиСредств(Объект.ЛицевойСчет,СписокДопустимыхКФО,СписокИсточниковСредствПоКФО);
	
	Для Каждого Стр Из Объект.РасшифровкаПлатежа Цикл
		
		Если СписокДопустимыхКФО.НайтиПоЗначению(Стр.КФО) = Неопределено Тогда
			Стр.КФО = "";
			Если СписокДопустимыхКФО.Количество() > 0 Тогда
				Стр.КФО = СписокДопустимыхКФО[0].Значение;
			КонецЕсли;
		КонецЕсли;
		
		ДопустимыеИсточникиСредств = ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(Объект.ЛицевойСчет,Стр.КФО);
		Если ДопустимыеИсточникиСредств.Найти(Стр.ИсточникСредств) = Неопределено Тогда
			Стр.ИсточникСредств = "";
			Если ДопустимыеИсточникиСредств.Количество() > 0 Тогда
				Стр.ИсточникСредств = ДопустимыеИсточникиСредств[0];
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.ВалютаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЛицевойСчет,"ВалютаСчета");
	
	ОбновитьКурсВалюты(ЭтаФорма,Объект);
	
КонецПРоцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКурсВалюты(Форма, Объект)

	КурсКратность = ПолучитьКурс(Объект.ВалютаДокумента,Форма.ДатаКурсаВалюты);
	Объект.Курс 			= КурсКратность.Курс;
	Объект.Кратность 		= КурсКратность.Кратность;
	
	ПересчитатьРублевоеПокрытие(Форма, Объект);
	
	РассчитатьКурсовуюРазницу(Форма, Объект);
	
КонецПроцедуры // ОбновитьКурсВалютыУстановитьДоступность()

&НаСервере
Процедура ПолучитьЛицевойСчетПоУмолчанию()
	
	Объект.ЛицевойСчет = Справочники.ЛицевыеСчета.ПолучитьЛицевойСчетПоУмолчанию(Объект.Организация, "Документ.ПоручениеНаПродажуВалюты", Объект.Дата, ,Объект.ВалютаДокумента);
	
	ПриИзмененииЛицевогоСчета();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЛицевойСчетЗачисления()
	
	Объект.СчетЗачисленияРублей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыСчетаЗачисления, "Владелец");

	ПолучитьРеквизитыСчетаЗачисления();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьРеквизитыСчетаЗачисления()
	
	Если НЕ ЗначениеЗаполнено(Объект.СчетЗачисленияРублей) Тогда
		КазначействоСтрока = "";
		СчетИБанкСтрока = "";
		Элементы.КазначействоСтрока.Видимость = Ложь;
		Элементы.СчетИБанкСтрока.Видимость = Ложь;
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетЗачисленияРублей, "ТипЛицевогоСчета") = Перечисления.ТипыЛицевыхСчетов.Казначейский Тогда
		РеквизитыСчетаЗачисленияСтруктура = Новый Структура("Счет, Казначейство, Банк", "СчетКазначейства.Код", "КассовыйОрган.НаименованиеПолное", "СчетКазначейства.КассовыйОрган.Наименование");
		РеквизитыСчетаЗачисления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.РеквизитыСчетаЗачисления, РеквизитыСчетаЗачисленияСтруктура);
		КазначействоСтрока = ""+РеквизитыСчетаЗачисления.Казначейство;
		СчетИБанкСтрока = "Счет № "+СокрЛП(РеквизитыСчетаЗачисления.Счет) + "; "+РеквизитыСчетаЗачисления.Банк;
		Элементы.КазначействоСтрока.Видимость = Истина;
		Элементы.СчетИБанкСтрока.Видимость = Истина;
	Иначе
		РеквизитыСчетаЗачисленияСтруктура = Новый Структура("Счет, Банк", "Владелец.Код", "КассовыйОрган.Наименование");
		РеквизитыСчетаЗачисления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.РеквизитыСчетаЗачисления, РеквизитыСчетаЗачисленияСтруктура);
		КазначействоСтрока = "";
		СчетИБанкСтрока = "Счет № "+СокрЛП(РеквизитыСчетаЗачисления.Счет) + "; "+РеквизитыСчетаЗачисления.Банк;
		Элементы.КазначействоСтрока.Видимость = Ложь;
		Элементы.СчетИБанкСтрока.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьВалютныхРеквизитов(Форма)
	
	ВидимостьДоступность = Не Форма.Объект.ВалютаДокумента = Форма.ВалютаРегламентированногоУчета;
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("Курс");
	Реквизиты.Добавить("Кратность");
	Реквизиты.Добавить("СуммаДокумента");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		Реквизиты, "Доступность", ВидимостьДоступность);
		
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("РасшифровкаПлатежаСумма");
	Реквизиты.Добавить("ИтогоПоступленийВал");
	Реквизиты.Добавить("НадписьВалютаИтоги");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		Реквизиты, "Видимость", ВидимостьДоступность);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьГруппыИсполнение(Форма)
	
	ДоступностьГруппыИсполнение = Ложь;
	Статус = Неопределено;
	
	Если ТипЗнч(Форма.УстановленныеРеквизитыИсполнения) = Тип("Структура") Тогда
		Если Форма.УстановленныеРеквизитыИсполнения.Свойство("Статус",Статус) Тогда
			ДоступностьГруппыИсполнение = Статус = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.Исполнен");
		КонецЕсли;
	КонецЕсли;
	
	Форма.Элементы.СуммаВалютаКурс.Доступность = ДоступностьГруппыИсполнение;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДатуКурсаВалюты(Форма)
	
	ДатаПроведения = Неопределено;
	
	Если ТипЗнч(Форма.УстановленныеРеквизитыИсполнения) = Тип("Структура") Тогда
		Форма.УстановленныеРеквизитыИсполнения.Свойство("ДатаПроведения",ДатаПроведения);
	КонецЕсли;
	
	Возврат ?(ДатаПроведения = Неопределено, Дата(1,1,1), ДатаПроведения);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКурс(Знач ВалютаДокумента, Дата)
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьРублевоеПокрытие(Форма, Объект)
	Объект.СуммаДокумента = Объект.СуммаДокументаВВалюте*Объект.Курс/?(Объект.Кратность=0,1,Объект.Кратность);
	Для Каждого ДанныеСтроки Из Объект.РасшифровкаПлатежа Цикл
		ДанныеСтроки.Сумма = ДанныеСтроки.СуммаВал*Объект.Курс/?(Объект.Кратность=0,1,Объект.Кратность);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокВыбораИсточникСредств(Знач ЛицевойСчет)
	Возврат ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(ЛицевойСчет);
КонецФункции

&НаСервере
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации()
	
	Элементы.ЛицевойСчет.Доступность = ЗначениеЗаполнено(Объект.Организация);
	Элементы.Подразделение.Доступность = ЗначениеЗаполнено(Объект.Организация);
	
КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовОрганизации()

&НаКлиенте
Процедура ИзменитьСтатусДокумента()
	
	ПлатежноРасчетныеДокументыКлиент.ОткрытьФормуИзмененияСтатусаДокумента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьКурсовуюРазницу(Форма, Объект)
	КурсоваяРазница = Объект.СуммаДокумента - Объект.СуммаРублейКЗачислению;
	ЗаголовокКурсовойРазницы = ?(КурсоваяРазница > 0, "Отрицательная курсовая разница:", "Положительная курсовая разница:");
	Форма.КурсоваяРазница = ?(КурсоваяРазница < 0, -КурсоваяРазница, КурсоваяРазница);
	Форма.КурсоваяРазницаЗаголовок = ЗаголовокКурсовойРазницы;
	Форма.КурсПродажиВалюты = ?(Объект.СуммаДокументаВВалюте = 0, 0, Объект.СуммаРублейКЗачислению / Объект.СуммаДокументаВВалюте);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьРазницуШапкиИИтогаТЧ(Форма)
	Объект = Форма.Объект;
	Форма.РазницаИтогаТЧ = Объект.РасшифровкаПлатежа.Итог("СуммаВал") - Объект.СуммаДокументаВВалюте;
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
